sql/db/artillery/testing.yml
# Tiger Eye Test
config:
  target: "http://localhost:3000"
  phases: 
    - duration: 10
      arrivalRate: 1000
      rampTo: 10000
  # processor: "./randomizer.js"

scenarios:
  - name: "Search Product ID"
    flow:
      # - function: "generateRandomData"
      - get:
          url: "/products/9347591"
          # url: "/products/7000000"
      # - log: "Sent a request to /products/{{ number }}"

# ===== example script below ======
# config:
#   target: "https://staging1.local"
#   phases:
#     - duration: 60
#       arrivalRate: 5
#     - duration: 120
#       arrivalRate: 5
#       rampTo: 50
#     - duration: 600
#       arrivalRate: 50
#   payload:
#     path: "keywords.csv"
#     fields:
#       - "keywords"
# scenarios:
#   - name: "Search and buy"
#     flow:
#       - post:
#           url: "/search"
#           body: "kw={{ keywords }}"
#           capture:
#             json: "$.results[0].id"
#             as: "id"
#       - get:
#           url: "/details/{{ id }}"
#       - think: 3
#       - post:
#           url: "/cart"
#           json:
#             productId: "{{ id }}"


# ex faker data:
# config:
#   target: "https://myapi.staging.example.com"
#   phases:
#     - duration: 60
#       arrivalRate: 20
#     - duration: 600
#       arrivalRate: 50
#   processor: "./my-functions.js"

# scenarios:
#   - name: "Register a user"
#     flow:
#       # call generateRandomData() to create the name, email, and password variables
#       - function: "generateRandomData"
#       - post:
#           url: "/users"
#           json:
#             name: "{{ name }}"
#             email: "{{ email }}"
#             password: "{{ password }}"
#       # Print the data we're sending while debugging the script:
#       - log: "Sent a request to /users with {{ name }}, {{ email }}, {{ password }}"